# Advanced `pandas`

In [4]:
%pylab inline
plt.style.use("bmh")

Populating the interactive namespace from numpy and matplotlib

In [0]:
import numpy as np
import pandas as pd

## Split-apply-combine

In [6]:
from google.colab import drive
drive.mount('/content/drive')

titanic_train = pd.read_csv(r"/content/drive/My Drive/Colab Notebooks/Y-data/Python for DS/Lecture 4/data/train.csv", index_col="PassengerId")
titanic_test = pd.read_csv(r"/content/drive/My Drive/Colab Notebooks/Y-data/Python for DS/Lecture 4/data/test.csv", index_col="PassengerId")
titanic = pd.concat([titanic_train, titanic_test], sort=False)

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [9]:
titanic.head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                 0.0       3  ...   NaN        S
2                 1.0       1  ...   C85        C
3                 1.0       3  ...   NaN        S
4                 1.0       1  ...  C123        S
5                 0.0       3  ...   NaN        S

[5 rows x 11 columns]

In [10]:
titanic.describe()

         Survived       Pclass  ...        Parch         Fare
count  891.000000  1309.000000  ...  1309.000000  1308.000000
mean     0.383838     2.294882  ...     0.385027    33.295479
std      0.486592     0.837836  ...     0.865560    51.758668
min      0.000000     1.000000  ...     0.000000     0.000000
25%      0.000000     2.000000  ...     0.000000     7.895800
50%      0.000000     3.000000  ...     0.000000    14.454200
75%      1.000000     3.000000  ...     0.000000    31.275000
max      1.000000     3.000000  ...     9.000000   512.329200

[8 rows x 6 columns]

# Scalar output

In [0]:
class_groups = titanic.groupby("Pclass")

In [12]:
class_groups

In [13]:
class_groups.mean()

        Survived        Age     SibSp     Parch       Fare
Pclass
1       0.629630  39.159930  0.436533  0.365325  87.508992
2       0.472826  29.506705  0.393502  0.368231  21.179196
3       0.242363  24.816367  0.568406  0.400564  13.302889

In [0]:
age_groups = titanic.Parch.groupby((5 + 10*(titanic.Age//10)))

In [15]:
age_groups

In [16]:
age_groups.mean() # Note index name

Age
5.0     1.390244
15.0    0.482517
25.0    0.223837
35.0    0.314655
45.0    0.503704
55.0    0.300000
65.0    0.531250
75.0    0.142857
85.0    0.000000
Name: Parch, dtype: float64

In [0]:
age_groups_npy = titanic.Parch.groupby((5 + 10*(titanic.Age//10)).values)

In [18]:
age_groups_npy.mean()

5.0     1.390244
15.0    0.482517
25.0    0.223837
35.0    0.314655
45.0    0.503704
55.0    0.300000
65.0    0.531250
75.0    0.142857
85.0    0.000000
Name: Parch, dtype: float64

In [0]:
age_groups_multi = titanic.Parch.groupby([(5 + 10*(titanic.Age//10)), titanic.Pclass])

In [0]:
age_groups_multi = titanic.Parch.groupby([titanic.Pclass, (5 + 10*(titanic.Age//10))])

In [58]:
age_groups_multi

In [59]:
age_groups_multi.mean()

Pclass  Age
1       5.0     2.000000
        15.0    0.863636
        25.0    0.480769
        35.0    0.250000
        45.0    0.209677
        55.0    0.369565
        65.0    0.761905
        75.0    0.250000
        85.0    0.000000
2       5.0     1.409091
        15.0    0.310345
        25.0    0.288889
        35.0    0.265625
        45.0    0.451613
        55.0    0.235294
        65.0    0.142857
        75.0    0.000000
3       5.0     1.339286
        15.0    0.445652
        25.0    0.128713
        35.0    0.395833
        45.0    0.976190
        55.0    0.000000
        65.0    0.000000
        75.0    0.000000
Name: Parch, dtype: float64

In [70]:
age_groups_multi.mean().unstack()

Age         5.0       15.0      25.0      35.0  ...      55.0      65.0  75.0  85.0
Pclass                                          ...
1       2.000000  0.863636  0.480769  0.250000  ...  0.369565  0.761905  0.25   0.0
2       1.409091  0.310345  0.288889  0.265625  ...  0.235294  0.142857  0.00   NaN
3       1.339286  0.445652  0.128713  0.395833  ...  0.000000  0.000000  0.00   NaN

[3 rows x 9 columns]

In [0]:
age_groups_mixed = titanic.groupby([(5 + 10*(titanic.Age//10)), "Pclass"])

In [68]:
age_groups_mixed.Parch.mean()

Age   Pclass
5.0   1         2.000000
      2         1.409091
      3         1.339286
15.0  1         0.863636
      2         0.310345
      3         0.445652
25.0  1         0.480769
      2         0.288889
      3         0.128713
35.0  1         0.250000
      2         0.265625
      3         0.395833
45.0  1         0.209677
      2         0.451613
      3         0.976190
55.0  1         0.369565
      2         0.235294
      3         0.000000
65.0  1         0.761905
      2         0.142857
      3         0.000000
75.0  1         0.250000
      2         0.000000
      3         0.000000
85.0  1         0.000000
Name: Parch, dtype: float64

# Series output

In [0]:
class_groups = titanic.groupby("Pclass") # Nothing is calculated yet

In [27]:
titanic.Fare.describe()

count    1308.000000
mean       33.295479
std        51.758668
min         0.000000
25%         7.895800
50%        14.454200
75%        31.275000
max       512.329200
Name: Fare, dtype: float64

In [28]:
class_groups.apply(lambda x: x.Fare.describe()) # Note column index name

Fare    count       mean        std  min      25%      50%       75%       max
Pclass
1       323.0  87.508992  80.447178  0.0  30.6958  60.0000  107.6625  512.3292
2       277.0  21.179196  13.607122  0.0  13.0000  15.0458   26.0000   73.5000
3       708.0  13.302889  11.494358  0.0   7.7500   8.0500   15.2458   69.5500

In [29]:
titanic.groupby("Sex").Parch.mean()

Sex
female    0.633047
male      0.247924
Name: Parch, dtype: float64

In [30]:
class_groups.apply(lambda x: x.groupby("Sex").Parch.mean()) # Note column index name

Sex       female      male
Pclass
1       0.472222  0.279330
2       0.650943  0.192982
3       0.731481  0.255578

In [74]:
class_groups.apply(lambda x: x[x.Parch==0].groupby("Sex").size())

Sex     female  male
Pclass
1           97   145
2           61   145
3          135   419

In [76]:
class_groups.apply(lambda x: x[x.Parch!=0].groupby(["Sex", "Embarked"]).size())

Pclass  Sex     Embarked
1       female  C           21
                S           26
        male    C           18
                S           16
2       female  C            4
                S           41
        male    C            3
                S           23
3       female  C           17
                Q            3
                S           61
        male    C           11
                Q            6
                S           57
dtype: int64

In [0]:
result = (class_groups
          .apply(lambda x: x[x.Parch!=0].groupby(["Sex", "Embarked"]).size())
          .unstack([1,2]))

In [34]:
result

Sex      female        male       female male
Embarked      C     S     C     S      Q    Q
Pclass
1          21.0  26.0  18.0  16.0    NaN  NaN
2           4.0  41.0   3.0  23.0    NaN  NaN
3          17.0  61.0  11.0  57.0    3.0  6.0

In [78]:
result.loc[:, [("female", "C"), ("male", "Q")]]

Sex      female male
Embarked      C    Q
Pclass
1          21.0  NaN
2           4.0  NaN
3          17.0  6.0

In [36]:
result.iloc[:, [0, 1]]

Sex      female
Embarked      C     S
Pclass
1          21.0  26.0
2           4.0  41.0
3          17.0  61.0

# DataFrame output

In [80]:
titanic[["SibSp", "Parch"]].head()

             SibSp  Parch
PassengerId
1                1      0
2                1      0
3                0      0
4                1      0
5                0      0

In [82]:
(class_groups
 .apply(lambda x: x[x.Parch!=0].groupby(["Sex", "Embarked"])[["SibSp", "Parch"]]
        .mean()))

                           SibSp     Parch
Pclass Sex    Embarked
1      female C         0.523810  1.285714
              S         0.807692  1.576923
       male   C         0.444444  1.388889
              S         0.875000  1.562500
2      female C         1.000000  1.750000
              S         0.682927  1.512195
       male   C         0.666667  1.666667
              S         0.869565  1.217391
3      female C         0.647059  1.411765
              Q         0.333333  2.666667
              S         1.934426  2.065574
       male   C         0.727273  1.090909
              Q         3.500000  1.000000
              S         2.491228  1.894737

## Mixing group keys

In [39]:
titanic.head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                 0.0       3  ...   NaN        S
2                 1.0       1  ...   C85        C
3                 1.0       3  ...   NaN        S
4                 1.0       1  ...  C123        S
5                 0.0       3  ...   NaN        S

[5 rows x 11 columns]

In [0]:
?titanic.set_index

In [0]:
titanic_idx = titanic.set_index((5 + 10*(titanic.Age//10)))

In [42]:
titanic_idx.head()

      Survived  Pclass  ... Cabin Embarked
Age                     ...
25.0       0.0       3  ...   NaN        S
35.0       1.0       1  ...   C85        C
25.0       1.0       3  ...   NaN        S
35.0       1.0       1  ...  C123        S
35.0       0.0       3  ...   NaN        S

[5 rows x 11 columns]

In [93]:
titanic_idx.groupby([pd.Grouper(level=0), "Pclass"]).Parch.mean()

Age   Pclass
5.0   1         2.000000
      2         1.409091
      3         1.339286
15.0  1         0.863636
      2         0.310345
      3         0.445652
25.0  1         0.480769
      2         0.288889
      3         0.128713
35.0  1         0.250000
      2         0.265625
      3         0.395833
45.0  1         0.209677
      2         0.451613
      3         0.976190
55.0  1         0.369565
      2         0.235294
      3         0.000000
65.0  1         0.761905
      2         0.142857
      3         0.000000
75.0  1         0.250000
      2         0.000000
      3         0.000000
85.0  1         0.000000
Name: Parch, dtype: float64

In [94]:
titanic_idx.groupby([titanic_idx.index, "Pclass"]).Parch.mean()

Age   Pclass
5.0   1         2.000000
      2         1.409091
      3         1.339286
15.0  1         0.863636
      2         0.310345
      3         0.445652
25.0  1         0.480769
      2         0.288889
      3         0.128713
35.0  1         0.250000
      2         0.265625
      3         0.395833
45.0  1         0.209677
      2         0.451613
      3         0.976190
55.0  1         0.369565
      2         0.235294
      3         0.000000
65.0  1         0.761905
      2         0.142857
      3         0.000000
75.0  1         0.250000
      2         0.000000
      3         0.000000
85.0  1         0.000000
Name: Parch, dtype: float64

# pd.Grouper

In [0]:
class_emb_groups = titanic.groupby([pd.Grouper("Embarked"), "Pclass"])

In [96]:
class_emb_groups.size()

Embarked  Pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
dtype: int64

# Join operations

In [0]:
a = pd.DataFrame(np.arange(8).reshape((4,2)),
                 columns=["a", "b"],
                 index=["a", "b", "a", "b"])
b = pd.DataFrame(10 + np.arange(4).reshape((4,-1)),
                 columns=["d"],
                 index=["d", "b", "c", "b"])

In [104]:
a.join(b) # default is left join

   a  b     d
a  0  1   NaN
a  4  5   NaN
b  2  3  11.0
b  2  3  13.0
b  6  7  11.0
b  6  7  13.0

In [105]:
a.join(b, how="inner")

   a  b   d
b  2  3  11
b  2  3  13
b  6  7  11
b  6  7  13

In [50]:
a.join(b, how="right")

     a    b   d
b  2.0  3.0  11
b  6.0  7.0  11
b  2.0  3.0  13
b  6.0  7.0  13
c  NaN  NaN  12
d  NaN  NaN  10

In [51]:
a.join(b, how="outer")

     a    b     d
a  0.0  1.0   NaN
a  4.0  5.0   NaN
b  2.0  3.0  11.0
b  2.0  3.0  13.0
b  6.0  7.0  11.0
b  6.0  7.0  13.0
c  NaN  NaN  12.0
d  NaN  NaN  10.0

In [52]:
titanic.head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                 0.0       3  ...   NaN        S
2                 1.0       1  ...   C85        C
3                 1.0       3  ...   NaN        S
4                 1.0       1  ...  C123        S
5                 0.0       3  ...   NaN        S

[5 rows x 11 columns]

In [0]:
family_names = (titanic
                .replace(re.compile(r'\s+\(.*\)'), '')
                .replace(re.compile("Mrs."), "Mr."))[["Name", "Sex"]]

In [54]:
titanic.head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                 0.0       3  ...   NaN        S
2                 1.0       1  ...   C85        C
3                 1.0       3  ...   NaN        S
4                 1.0       1  ...  C123        S
5                 0.0       3  ...   NaN        S

[5 rows x 11 columns]

In [55]:
family_names.head()

                                    Name     Sex
PassengerId
1                Braund, Mr. Owen Harris    male
2              Cumings, Mr. John Bradley  female
3                 Heikkinen, Miss. Laina  female
4            Futrelle, Mr. Jacques Heath  female
5               Allen, Mr. William Henry    male

In [0]:
family_names = family_names[(family_names.Sex=="female") & family_names.Name.str.contains("Mr.")]

In [113]:
family_names.head()

                                    Name     Sex
PassengerId
2              Cumings, Mr. John Bradley  female
4            Futrelle, Mr. Jacques Heath  female
9                   Johnson, Mr. Oscar W  female
10                  Nasser, Mr. Nicholas  female
16                         Hewlett, Mr.   female

In [0]:
family_names.reset_index().set_index("Name")#["PassengerId"]

                                       PassengerId     Sex
Name
Cumings, Mr. John Bradley                        2  female
Futrelle, Mr. Jacques Heath                      4  female
Johnson, Mr. Oscar W                             9  female
Nasser, Mr. Nicholas                            10  female
Hewlett, Mr.                                    16  female
Vander Planke, Mr. Julius                       19  female
Masselmani, Mr. Fatima                          20  female
Asplund, Mr. Carl Oscar                         26  female
Spencer, Mr. William Augustus                   32  female
Ahlin, Mr. Johan                                41  female
Turpin, Mr. William John Robert                 42  female
Arnold-Franchi, Mr. Josef                       50  female
Harper, Mr. Henry Sleeper                       53  female
Faunthorpe, Mr. Lizzie                          54  female
Nye, Mr.                                        67  female
Backstrom, Mr. Karl Alfred                      86  female
Doling, Mr. John T                              99  female
Robins, Mr. Alexander A                        133  female
Weisz, Mr. Leopold                             134  female
Boulos, Mr. Joseph                             141  female
Hakkarainen, Mr. Pekka Pietari                 143  female
Pears, Mr. Thomas                              152  female
Watt, Mr. James                                162  female
Chibnall, Mr.                                  167  female
Skoog, Mr. William                             168  female
O'Brien, Mr. Thomas                            187  female
Pinsky, Mr.                                    191  female
Brown, Mr. James Joseph                        195  female
Harris, Mr. Henry Birkhardt                    231  female
Hamalainen, Mr. William                        248  female
...                                            ...     ...
Douglas, Mr. Walter Donald                    1131  female
Lindstrom, Mr. Carl Johan                     1132  female
Christy, Mr.                                  1133  female
Karnes, Mr. J Frank                           1138  female
Hold, Mr. Stephen                             1140  female
Khalil, Mr. Betros"                           1141  female
Wells, Mr. Arthur Henry"                      1154  female
Clark, Mr. Walter Miller                      1164  female
Crosby, Mr. Edward Gifford                    1197  female
Hansen, Mr. Claus Peter                       1201  female
White, Mr. John Stuart                        1206  female
Davies, Mr. John Morgan                       1222  female
Nakid, Mr. Said"                              1225  female
Cardeza, Mr. James Warburton Martinez         1235  female
Whabee, Mr. George Joseph                     1239  female
Greenfield, Mr. Leo David                     1242  female
Brown, Mr. John Murray                        1248  female
Lindell, Mr. Edvard Bengtsson                 1251  female
Mallet, Mr. Albert                            1253  female
Ware, Mr. John James                          1254  female
Harder, Mr. George Achilles                   1256  female
Sage, Mr. John                                1257  female
Gibson, Mr. Leonard                           1260  female
Dodge, Mr. Washington                         1266  female
Risien, Mr. Samuel                            1274  female
McNamee, Mr. Neal                             1275  female
Lines, Mr. Ernest H                           1283  female
Smith, Mr. Lucien Philip                      1287  female
Frolicher-Stehli, Mr. Maxmillian              1289  female
Minahan, Mr. William Edward                   1303  female

[197 rows x 2 columns]

In [0]:
titanic = (titanic.join(family_names
                        .reset_index()
                        .set_index("Name")["PassengerId"],
                        on="Name", rsuffix="_Spouse"))

In [115]:
titanic.head(25)

             Survived  Pclass  ... Embarked PassengerId
PassengerId                    ...
1                 0.0       3  ...        S         NaN
2                 1.0       1  ...        C         NaN
3                 1.0       3  ...        S         NaN
4                 1.0       1  ...        S         NaN
5                 0.0       3  ...        S         NaN
6                 0.0       3  ...        Q         NaN
7                 0.0       1  ...        S         NaN
8                 0.0       3  ...        S         NaN
9                 1.0       3  ...        S         NaN
10                1.0       2  ...        C         NaN
11                1.0       3  ...        S         NaN
12                1.0       1  ...        S         NaN
13                0.0       3  ...        S         NaN
14                0.0       3  ...        S       611.0
15                0.0       3  ...        S         NaN
16                1.0       2  ...        S         NaN
17                0.0       3  ...        Q         NaN
18                1.0       2  ...        S         NaN
19                0.0       3  ...        S         NaN
20                1.0       3  ...        C         NaN
21                0.0       2  ...        S         NaN
22                1.0       2  ...        S         NaN
23                1.0       3  ...        Q         NaN
24                1.0       1  ...        S         NaN
25                0.0       3  ...        S         NaN

[25 rows x 12 columns]

In [0]:
titanic.rename({"PassengerId":"PassengerId_Spouse"}, axis=1, inplace=True)

In [117]:
titanic.head()

             Survived  Pclass  ... Embarked PassengerId_Spouse
PassengerId                    ...
1                 0.0       3  ...        S                NaN
2                 1.0       1  ...        C                NaN
3                 1.0       3  ...        S                NaN
4                 1.0       1  ...        S                NaN
5                 0.0       3  ...        S                NaN

[5 rows x 12 columns]

In [0]:
titanic = titanic.join(titanic[["Name", "Age"]],
                       on="PassengerId_Spouse", rsuffix="_Spouse")

In [120]:
titanic

             Survived  Pclass  ... Name_Spouse Age_Spouse
PassengerId                    ...
1                 0.0       3  ...         NaN        NaN
2                 1.0       1  ...         NaN        NaN
3                 1.0       3  ...         NaN        NaN
4                 1.0       1  ...         NaN        NaN
5                 0.0       3  ...         NaN        NaN
...               ...     ...  ...         ...        ...
1305              NaN       3  ...         NaN        NaN
1306              NaN       1  ...         NaN        NaN
1307              NaN       3  ...         NaN        NaN
1308              NaN       3  ...         NaN        NaN
1309              NaN       3  ...         NaN        NaN

[1309 rows x 14 columns]

In [119]:
titanic[titanic.PassengerId_Spouse.notnull()][["Pclass", "Name", "Age", "Name_Spouse", "Age_Spouse"]]

             Pclass  ... Age_Spouse
PassengerId          ...
14                3  ...       39.0
35                1  ...        NaN
36                1  ...       35.0
63                1  ...       35.0
93                1  ...       47.0
...             ...  ...        ...
1208              1  ...        NaN
1245              2  ...       48.0
1258              3  ...        NaN
1286              3  ...       26.0
1299              1  ...       50.0

[86 rows x 5 columns]

In [0]:
(titanic.Age - titanic.Age_Spouse).groupby(titanic.Pclass).agg(["min", "max", "mean", "std"])

         min   max      mean       std
Pclass
1      -40.0  14.0  2.805556  9.211234
2       -2.0  20.0  6.195652  6.793612
3       -4.0  12.0  3.472222  3.798112

In [123]:
titanic.loc[742]

Survived                                                              0
Pclass                                                                1
Name                                      Cavendish, Mr. Tyrell William
Sex                                                                male
Age                                                                  36
SibSp                                                                 1
Parch                                                                 0
Ticket                                                            19877
Fare                                                              78.85
Cabin                                                               C46
Embarked                                                              S
PassengerId_Spouse                                                  988
Name_Spouse           Cavendish, Mrs. Tyrell William (Julia Florence...
Age_Spouse                                                           76
Name: 742, dtype: object

In [0]:
FTS_COLS = titanic.columns[1:-3].tolist()
FTS_COLS.remove("Cabin")

In [0]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 1 to 1309
Data columns (total 14 columns):
Survived              891 non-null float64
Pclass                1309 non-null int64
Name                  1309 non-null object
Sex                   1309 non-null object
Age                   1046 non-null float64
SibSp                 1309 non-null int64
Parch                 1309 non-null int64
Ticket                1309 non-null object
Fare                  1308 non-null float64
Cabin                 295 non-null object
Embarked              1307 non-null object
PassengerId_Spouse    86 non-null float64
Name_Spouse           86 non-null object
Age_Spouse            77 non-null float64
dtypes: float64(5), int64(3), object(6)
memory usage: 193.4+ KB

In [0]:
titanic[FTS_COLS].isnull().any(axis=1).sum()

266

In [0]:
titanic[(titanic.Age - titanic.Age_Spouse)<0][["Pclass", "Name", "Age", "Name_Spouse", "Age_Spouse"]]

,Pclass,Name,Age,Name_Spouse,Age_Spouse
PassengerId,,,,,
93,1,"Chaffee, Mr. Herbert Fuller",46.0,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",47.0
207,3,"Backstrom, Mr. Karl Alfred",32.0,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",33.0
249,1,"Beckwith, Mr. Richard Leonard",37.0,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",47.0
315,2,"Hart, Mr. Benjamin",43.0,"Hart, Mrs. Benjamin (Esther Ada Bloomfield)",45.0
622,1,"Kimball, Mr. Edwin Nelson Jr",42.0,"Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)",45.0
646,1,"Harper, Mr. Henry Sleeper",48.0,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",49.0
725,1,"Chambers, Mr. Norman Campbell",27.0,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",33.0
742,1,"Cavendish, Mr. Tyrell William",36.0,"Cavendish, Mrs. Tyrell William (Julia Florence...",76.0
861,3,"Hansen, Mr. Claus Peter",41.0,"Hansen, Mrs. Claus Peter (Jennie L Howard)",45.0
993,2,"Weisz, Mr. Leopold",27.0,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",29.0
1082,2,"Angle, Mr. William A",34.0,"Angle, Mrs. William A (Florence ""Mary"" Agnes H...",36.0
1170,2,"Ware, Mr. John James",30.0,"Ware, Mrs. John James (Florence Louise Long)",31.0